---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.ICodeCheckingParameterServer
source: html/c6dab27b-f0c8-31b9-6e76-6b477c5db46e.htm
---
# ICodeCheckingParameterServer Members

Implement this method to return a description of the server.